app/Controllers/User.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        return view('users',[
            'users' => $this->userModel->paginate(10),
            'pager' =>$this->userModel->pager
        ]);

DELETE FROM `users`
WHERE `id` IN ('index.php')
---
    public function delete($id){
        if($this->userModel->delete($id)){

UPDATE `users` SET `username` = 'bootstrap', `first_name` = 'bootstrap', `last_name` = 'bootstrapa'
WHERE `users`.`id` IN ('8')
---
        public function store(){
            if($this->userModel->save($this->request->getPost())){

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
        public function edit($id){
            return view('form',[
                'user' => $this->userModel->find($id)
            ]);